In [1]:
import pandas as pd #import pandas
#create student dataframe by reading csv file
df= pd.read_csv('marks_data.csv')
print(df.head()) # check first 5 rows

   STUDENT_ID              Name  Math  Science  English  Total           Grade
0           1  Hertha Georgescu    65       21        9    113     Grass-roots
1           2     Port Ferronet    25       15       71     36      methodical
2           3      Tony Beadell    46       12       27    203    installation
3           4        Erica Cote     2       75       87    272        tangible
4           5  Lilllie Dryburgh    79        3       47    251  fault-tolerant

In [2]:
df.isna() # check na values

    STUDENT_ID   Name   Math  Science  English  Total  Grade
0        False  False  False    False    False  False  False
1        False  False  False    False    False  False  False
2        False  False  False    False    False  False  False
3        False  False  False    False    False  False  False
4        False  False  False    False    False  False  False
..         ...    ...    ...      ...      ...    ...    ...
95       False  False  False    False    False  False  False
96       False  False  False    False    False  False  False
97       False  False  False    False    False  False  False
98       False  False  False    False    False  False  False
99       False  False  False    False    False  False  False

[100 rows x 7 columns]

In [6]:
df['Total']=df[['Math','Science','English']].sum(axis=1)
df[['Name','Math','Science','English','Total']].head() #just verify the Total

               Name  Math  Science  English  Total
0  Hertha Georgescu    65       21        9     95
1     Port Ferronet    25       15       71    111
2      Tony Beadell    46       12       27     85
3        Erica Cote     2       75       87    164
4  Lilllie Dryburgh    79        3       47    129

In [7]:
def assign_grades(total):
    if total>=250:
        return 'A'
    elif total>=200:
        return 'B'
    elif total>=150:
        return 'C'
    else:
        return 'D'

In [10]:
df['Grade']= df['Total'].apply(assign_grades) ##Assign grades based on function

In [11]:
df[['Name','Total','Grade']].tail()

                 Name  Total Grade
95    Dominga Macieja    161     C
96         Tam Hillam    226     B
97  Latashia Behninck    198     C
98         Ilsa Calan    176     C
99       Henrik Markl    154     C

In [12]:
grade_a_students= df[df['Grade']=='A']
print(grade_a_students)

    STUDENT_ID             Name  Math  Science  English  Total Grade
21          22      Base Alcott    91       97       93    281     A
31          32      Rona Hallad    99       54       97    250     A
71          72  Luisa De Micoli    88       81       87    256     A
87          88     Glyn Wheelan    84       91       78    253     A

In [15]:
grade_b_students= df[df['Grade']=='B']
print('No of students secured grade B:',len(grade_b_students))

No of students secured grade B: 15

In [17]:
print('Total No of students failed:', len(df[df['Grade']=='D']))

Total No of students failed: 47

In [18]:
math_max= max(df['Math'])
print(math_max)

100

In [19]:
print(df[df['Math']==math_max])

    STUDENT_ID         Name  Math  Science  English  Total Grade
17          18   Ab Glasbey   100      100       45    245     B
46          47  Lane Maharg   100       80       38    218     B

In [22]:
df.to_csv('result.csv',index=False)
print("File Created successfully")

File Created successfully

In [27]:
## Store Data
store = pd.read_csv('store_data.csv')
# print(store)
most_sold_product= store.groupby('Product')['Quantity'].sum().idxmax()
print(most_sold_product)

Gionee Marathon M4

In [35]:
df1= pd.DataFrame({
    "id":[1,2,3,4,5],
    "name":["p1","p2","p1","p2","p3"],
    "quantity":[1,2,2,2,3],
    "price":[10,20,10,20,30]
})
# print(df1)
print(df1.groupby('name')['quantity'].sum().idxmax())

p2